//HMVS01A JOB (TSO),'EXECUTE FILEIO',
//           CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1),
//           USER=HMVS01,PASSWORD=CUL8TR,
//           REGION=8192K,
//           NOTIFY=HMVS01
//GO       EXEC PGM=FILEIO,REGION=5000K
//STEPLIB   DD DSN=HMVS01.LOAD,DISP=SHR
//OUTPUT    DD DSN=HMVS01.TEST,DISP=(NEW,CATLG),
//             SPACE=(CYL,(4,1)),DCB=(RECFM=FB,LRECL=80,BLKSIZE=3120),
//             UNIT=3380,VOL=SER=PUB000
//SYSPRINT  DD SYSOUT=*
//SYSTERM   DD SYSOUT=*
//SYSIN     DD *
/*