//HMVS01A JOB (TSO),'ADDER',
//           CLASS=A,
//           MSGCLASS=A,
//           MSGLEVEL=(1,1),
//           USER=HMVS01,PASSWORD=CUL8TR,
//           REGION=8192K,
//           NOTIFY=HMVS01
//GO       EXEC PGM=ADDER,PARM='3 4'
//STEPLIB   DD DSN=HMVS01.LOAD,DISP=SHR
//SYSPRINT  DD SYSOUT=*
//SYSTERM   DD SYSOUT=*
//SYSIN     DD *
/*
