//HMVS01A JOB (TSO),
//          'Test DDT Server',
//          REGION=2048K,
//          CLASS=A,
//          MSGCLASS=A,
//          MSGLEVEL=(1,1),
//          USER=HMVS01,PASSWORD=CUL8TR
//TEST     EXEC PGM=MVSDDT,PARM=(IEFBR14)
//#DDTCMD  DD   UNIT=610
//#DDTDATA DD   UNIT=611
//STEPLIB  DD   DSN=SYS2.LINKLIB,DISP=SHR
//SYSABEND DD SYSOUT=*
