//HMVS01A JOB (TSO),
//           'ADDER',
//           CLASS=A,
//           MSGCLASS=A,
//           MSGLEVEL=(1,1),
//           USER=HMVS01,PASSWORD=CUL8TR,
//           REGION=8192K,
//           NOTIFY=HMVS01
//TEST EXEC PGM=MVSDDT,PARM=(ADDER,'3 4')
//#DDTCMD   DD UNIT=610
//#DDTDATA  DD UNIT=611
//STEPLIB   DD DSN=HMVS01.LOAD,DISP=SHR
//SYSPRINT  DD SYSOUT=*
//SYSTERM   DD SYSOUT=*
//SYSABEND  DD SYSOUT=*
//SYSIN     DD *
/*
