       IDENTIFICATION DIVISION.
       PROGRAM-ID. UPDATING.
       REMARKS. THIS IS A SIMPLIFIED UPDATE PROGRAM, USED AS AN
           EXAMPLE OF BASIC COBOL TECHNIQUES. THE PROGRAM IS
           EXPLAINED IN DETAIL IN THE INTRODUCTION TO THIS MANUAL.
       
       ENVIRONMENT DIVISION.
       
       CONFIGURATION SECTION.
       
       SOURCE-COMPUTER. IBM-370.
       OBJECT-COMPUTER. IBM-370.
       
       INPUT-OUTPUT SECTION.
       
       FILE-CONTROL.
           SELECT MASTER-FILE ASSIGN TO DA-D-MASTER
              ACCESS MODE IS RANDOM
              ACTUAL KEY IS FILEKEY.
           
           SELECT DETAIL-FILE ASSIGN TO DA-S-INFILE
              ACCESS IS SEQUENTIAL.
           
           SELECT ACTION-FILE ASSIGN TO DA-S-OUTFILE.
       
       DATA DIVISION.
       
       FILE SECTION.
       
       FD  MASTER-FILE LABEL RECORDS ARE STANDARD
           DATA RECORD IS MASTER-RECORD.
       01  MASTER-RECORD.
           05 ITEM-CODE PICTURE X(3).
           05 ITEM-NAME PICTURE X(29).
           05 STOCK-ON-HAND PICTURE S9(6) USAGE COMP SYNC.
           05 UNIT-PRICE PICTURE S999V99 USAGE COMP SYNC.
           05 STOCK-VALUE PICTURE S9(9)V99 USAGE COMP SYNC.
           05 ORDER-POINT PICTURE S9(3) USAGE COMP SYNC.
       
       FD  DETAIL-FILE LABEL RECORDS ARE STANDARD
           DATA RECORD IS DETAIL-RECORD.
       01  DETAIL-RECORD.
           05 ITEM-CODE PICTURE X(3).
           05 ITEM-NAME PICTURE X(29).
           05 RECEIPTS PICTURE S9(3) USAGE COMP SYNC.
           05 SHIPMENTS PICTURE S9(3) USAGE COMP SYNC.
       
       FD  ACTION-FILE LABEL RECORDS ARE STANDARD
           DATA RECORD IS ACTION-RECORD.
       01  ACTION-RECORD.
           05 ITEM-CODE PICTURE X(3).
           05 ITEM-NAME PICTURE X(29).
           05 STOCK-ON-HAND PICTURE S9(6) USAGE COMP SYNC.
           05 UNIT-PRICE PICTURE S999V99 USAGE COMP SYNC.
           05 ORDER-POINT PICTURE S9(3) USAGE COMP SYNC.
       
       WORKING-STORAGE SECTION.
       
       77  SAVE PICTURE S9(10) USAGE COMP SYNC.
       
       77  QUOTIENT PICTURE S9999 USAGE COMP SYNC.
       
       01  FILEKEY.
           05 TRACK-ID PICTURE S9(5) USAGE COMP SYNC.
           05 RECORD-ID PICTURE X(29).
       
       01  ERROR-MESSAGE.
           05 ERROR-MESSAGE-1 PICTURE X(20).
           05 ERROR-MESSAGE-2 PICTURE X(36).
           05 ERROR-MESSAGE-3 PICTURE X(46).
       
       PROCEDURE DIVISION.
       
       OPEN-FILES-ROUTINE.
           OPEN INPUT DETAIL-FILE.
           
           OPEN I-O MASTER-FILE.
       
       NEXT-DETAIL-RECORD-ROUTINE.
           READ DETAIL-FILE AT END GO TO END-ROUTINE-1.
       
       NEXT-MASTER-RECORD-ROUTINE.
           MOVE ITEM-CODE IN DETAIL-RECORD TO SAVE.
           
           DIVIDE 19 INTO SAVE GIVING QUOTIENT
              REMAINDER TRACK-ID.
           
           MOVE ITEM-NAME IN DETAIL-RECORD TO RECORD-ID.
           
           READ MASTER-FILE INVALID KEY
               PERFORM INPUT-ERROR GO TO ERROR-WRITE.
       
       COMPUTATION-ROUTINE.
           COMPUTE STOCK-ON-HAND IN MASTER-RECORD = 
              STOCK-ON-HAND IN MASTER-RECORD + 
              RECEIPTS - 
              SHIPMENTS.
           
           IF STOCK-ON-HAND IN MASTER-RECORD IS LESS THAN ZERO
              PERFORM DATA-ERROR GO TO ERROR-WRITE.
           
           MULTIPLY STOCK-ON-HAND IN MASTER-RECORD BY UNIT-PRICE
              IN MASTER-RECORD GIVING STOCK-VALUE
              IN MASTER-RECORD.
           
           IF STOCK-ON-HAND IN MASTER-RECORD IS NOT GREATER THAN
              ORDER-POINT IN MASTER-RECORD PERFORM REORDER-1
              THRU REORDER-2.
       
       WRITE-MASTER-ROUTINE.
           WRITE MASTER-RECORD INVALID KEY
              PERFORM OUTPUT-ERROR GO TO ERROR-WRITE.

           GO TO NEXT-DETAIL-RECORD-ROUTINE.

       REORDER-1. 
           GO TO SWITCH-ROUTINE.
       
       SWITCH-ROUTINE.
           ALTER REORDER-1 TO REORDER-2
              END-ROUTINE-1 TO END-ROUTINE-3.
           
           DISPLAY 'ACTION FILE UTILIZED'.
           
           OPEN OUTPUT ACTION-FILE.
       
       REORDER-2.
           MOVE CORRESPONDING MASTER-RECORD TO ACTION-RECORD.
           
           WRITE ACTION-RECORD.
       
       ERROR-WRITE.
           MOVE DETAIL-RECORD TO ERROR-MESSAGE-2.
           
           DISPLAY ERROR-MESSAGE.
           
           GO TO NEXT-DETAIL-RECORD-ROUTINE.
       
       INPUT-ERROR.
           MOVE ' KEY ERROR ON INPUT ' TO ERROR-MESSAGE-1.
           
           MOVE SPACES TO ERROR-MESSAGE-3.
       
       DATA-ERROR.
           MOVE 'DATA ERROR ON INPUT ' TO ERROR-MESSAGE-1.
           
           MOVE MASTER-RECORD TO ERROR-MESSAGE-3.
       
       OUTPUT-ERROR.
           MOVE 'KEY ERROR ON OUTPUT ' TO ERROR-MESSAGE-1.
           
           MOVE SPACES TO ERROR-MESSAGE-3.
       
       END-ROUTINE-1.
           GO TO END-ROUTINE-2.
       
       END-ROUTINE-3.
           CLOSE ACTION-FILE.
       
       END-ROUTINE-2.
           CLOSE DETAIL-FILE.
           
           CLOSE MASTER-FILE.
